uhnp/src/Documents/НастраиваемыйОтчет/НастраиваемыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НастраиваемыйОтчет</name>
  <basedOn>Catalog.БланкиОтчетов</basedOn>
  <basedOn>Catalog.ВидыОтчетов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВывода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОтчета</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечанияБланков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтображения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыКонтекстногоОбновленияЗависимыхЯчеек</name>
    <type>
      <types>EnumRef.ПараметрыКонтекстногоОбновленияЗависимыхЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлИмпорта</name>
    <type>
      <types>CatalogRef.ХранимыеФайлыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеПериодом</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончания</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияОтчета</name>
    <type>
      <types>EnumRef.СпособыФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоПроверки</name>
    <type>
      <types>CatalogRef.ПравилаПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкИмпорта</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСвертывания</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтениеНеактуальныхЗаписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВноситьИзменения</name>
    <comment>Не вносить изменения в отчет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Состояние</name>
    <type>
      <types>EnumRef.СостоянияОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеВалюты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭкземплярыИсточники</name>
    <attributes>
      <name>ЭкземплярОтчета</name>
      <type>
        <types>DocumentRef.НастраиваемыйОтчет</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/СведенияОбИзмененииДокументов/СведенияОбИзмененииДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОбИзмененииДокументов</name>
  <resources>
    <name>ПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.КорректировкаЗначенийПоказателей</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
      <types>DocumentRef.НастраиваемыйОтчет</types>
      <types>DocumentRef.Элиминация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СостоянияОтчетов/СостоянияОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОтчетов</name>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Возвращен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>ЗаписанСОшибкой</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/УправлениеПериодомСценария/УправлениеПериодомСценария.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УправлениеПериодомСценария</name>
  <posting>Deny</posting>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяПериодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценарияОкончание</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОрганизационнойСтруктуры</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроцесса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЛимиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСкользящегоПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаАктуализации</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийГоризонт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗапускатьПроцесс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭкземплярПроцесса</name>
    <type>
      <types>DocumentRef.ЭкземплярПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаНачалаСверкиВГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаОкончанияСверкиВГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПервоеПрименение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыОтчетовДляУстановкиЛимитов</name>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>CatalogRef.ВидыОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПериодическиеКурсы</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПериодМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаНачалоПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаКонецПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПредыдущийПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаКонецПредыдущегоПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/НастраиваемыйОтчет/Forms/ФормаНастроекДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВводНовогоДокумента = Истина;
	Если Параметры.Свойство("Объект") Тогда
		
		// Существующий документ
		КопироватьДанныеФормы(Параметры.Объект, Объект);
		ВводНовогоДокумента = Ложь;
		
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		// Документ создается копированием
		ЗначениеКопирования = Параметры.ЗначениеКопирования;
		Элементы.ЗначениеКопирования.Видимость = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастраиваемыйОтчет.ВидОтчета КАК ВидОтчета,
			|	НастраиваемыйОтчет.ШаблонОтчета КАК ШаблонОтчета,
			|	НастраиваемыйОтчет.Проект КАК Проект,
			|	НастраиваемыйОтчет.Аналитика1 КАК Аналитика1,
			|	НастраиваемыйОтчет.Аналитика2 КАК Аналитика2,
			|	НастраиваемыйОтчет.Аналитика3 КАК Аналитика3,
			|	НастраиваемыйОтчет.Аналитика4 КАК Аналитика4,
			|	НастраиваемыйОтчет.Аналитика5 КАК Аналитика5,
			|	НастраиваемыйОтчет.Аналитика6 КАК Аналитика6,
			|	НастраиваемыйОтчет.Сценарий КАК Сценарий,
			|	НастраиваемыйОтчет.УправлениеПериодом КАК УправлениеПериодом,
			|	НастраиваемыйОтчет.Организация КАК Организация,
			|	НастраиваемыйОтчет.ПериодОтчета КАК ПериодОтчета,
			|	НастраиваемыйОтчет.ПериодОкончания КАК ПериодОкончания,
			|	НастраиваемыйОтчет.ВалютаОтображения КАК ВалютаОтображения,
			|	НастраиваемыйОтчет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	НастраиваемыйОтчет.УровеньТочности КАК УровеньТочности
			|ИЗ
			|	Документ.НастраиваемыйОтчет КАК НастраиваемыйОтчет
			|ГДЕ
			|	НастраиваемыйОтчет.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЗначениеКопирования);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Объект, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВводНовогоДокумента Тогда
		
		Заголовок = НСтр("ru = 'Укажите ключевые реквизиты документа'");
		
		// Создание нового документа
		Элементы.ГруппаПоследнееИзменение.Видимость = Ложь;
		
		Если ЗначениеЗаполнено(Объект.Сценарий) Тогда
			ПодобратьПериодПоСценарию();
		КонецЕсли;
		
	Иначе
		
		Заголовок = НСтр("ru = 'Настройки документа'");
		Элементы.ВидОтчета.ТолькоПросмотр = Истина;
		
		// Сведения о редактировавшем
		СведенияОбИзмененииДокументов = РегистрыСведений.СведенияОбИзмененииДокументов.ПолучитьСведения(Объект.Ссылка);
		ДатаИзменения = СведенияОбИзмененииДокументов.ДатаИзменения;
		ПоследнийРедактировавший = СведенияОбИзмененииДокументов.ПоследнийРедактировавший;
		
	КонецЕсли;
	
	Элементы.ПериодичностьОтчета.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ИзменитьПериод.Доступность = НЕ ТолькоПросмотр;
	Элементы.ФормаПрименитьИЗакрыть.Доступность = НЕ ТолькоПросмотр;
	Элементы.НастройкиОбработкиДанных.ТолькоПросмотр = ТолькоПросмотр
		ИЛИ НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиОбработкиШаблоновДокументов);
	
	// Данные вида отчета
	УправлениеВидимостьюДанныхВидаОтчета();
	
	Если Параметры.Свойство("МаксАналитикОтчета") Тогда
		МаксАналитикОтчета = Параметры.МаксАналитикОтчета;
	КонецЕсли;
	Если Параметры.Свойство("СтатусОбъекта") И Параметры.СтатусОбъекта = Перечисления.СостоянияОтчетов.Утвержден Тогда
		ОграничитьРедактированиеКлючевыхРеквизитов(ЭтотОбъект, МаксАналитикОтчета);
	КонецЕсли;
	
	// Ключевые реквизиты
	УстановитьПараметрыПоКлючевымРеквизитам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ВводНовогоДокумента Тогда
		Модифицированность = Ложь;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		СтруктураПараметров = Новый Структура;
		ТекстВопроса = НСтр("ru = 'Применить произведенные изменения?'");
		Режим = РежимДиалогаВопрос.ДаНетОтмена;
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеПрименениеЗавершение", ЭтаФорма, СтруктураПараметров);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПрименениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь;
		Закрыть(Неопределено);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		ПрименитьИЗакрыть(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НеключевойРеквизитПриИзменении(Элемент=Неопределено)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючевойРеквизитПриИзменении(Элемент=Неопределено)
	
	ИзмененКлючевойРеквизит = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиДокументаПриИзменении()
	
	ИзмененыНастройкиОбработкиДокумента = Истина;
	НеключевойРеквизитПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	
	КлючевойРеквизитПриИзменении();
	ВидОтчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидОтчетаПриИзмененииНаСервере()
	
	УправлениеВидимостьюДанныхВидаОтчета();
	
	УстановитьПараметрыПоКлючевымРеквизитам();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОтчетаПриИзменении(Элемент)
	
	НастройкиОбработкиДокументаПриИзменении();
	ШаблонОтчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ШаблонОтчетаПриИзмененииНаСервере()
	
	РежимБланка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ШаблонОтчета, "РежимБланка");
	Если РежимБланка = 1 Тогда
		Объект.СпособВывода = "СводнаяТаблица";
	ИначеЕсли РежимБланка = 2 Тогда
		Объект.СпособВывода = "Бланк";
	Иначе
		Объект.СпособВывода = "";
	КонецЕсли;
	
	БланкДляОтображения = Объект.ШаблонОтчета;
	
	УправлениеОтчетамиУХ.ЗаполнитьПараметрыОтображения(
		Объект.ЕдиницаИзмерения, Объект.УровеньТочности, Объект.ШаблонОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	КлючевойРеквизитПриИзменении();
	СценарийПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СценарийПриИзмененииНаСервере()
	
	ПодобратьПериодПоСценарию();
	
	УстановитьПараметрыПоКлючевымРеквизитам();
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьПериодПоСценарию()

	// Заполним период, если для данного сценария он один
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УправлениеПериодомСценария.ПериодСценария КАК ПериодСценария
		|ИЗ
		|	Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
		|ГДЕ
		|	УправлениеПериодомСценария.Сценарий = &Сценарий
		|	И НЕ УправлениеПериодомСценария.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Сценарий", Объект.Сценарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		Объект.ПериодОтчета = ВыборкаДетальныеЗаписи.ПериодСценария;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеПериодомПриИзменении(Элемент)
	
	КлючевойРеквизитПриИзменении();
	УправлениеПериодомПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеПериодомПриИзмененииНаСервере()
	
	ЗаполнитьДанныеПоУправлениюПериодом();
	
	УстановитьПараметрыПоКлючевымРеквизитам();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоУправлениюПериодом()
	
	ДанныеУправленияПериодом = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.УправлениеПериодом, "ПериодСценария, Сценарий");
	
	Объект.Сценарий = ДанныеУправленияПериодом.Сценарий;
	Объект.ПериодОтчета = ДанныеУправленияПериодом.ПериодСценария;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	КлючевойРеквизитПриИзменении();
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.ОсновнаяВалюта = Неопределено;
	Объект.ВалютаОтображения = Неопределено;
	
	УстановитьПараметрыПоКлючевымРеквизитам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьОтчетаПриИзменении(Элемент)

	ПериодичностьОтчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПериодичностьОтчетаПриИзмененииНаСервере()
	
	ПериодичностьОтчетаПрошлая = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПериодОтчета, "Периодичность");
	Если ПериодичностьОтчета = ПериодичностьОтчетаПрошлая Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПериодОтчета = Неопределено;
	Объект.ПериодОкончания = Неопределено;
	
	УстановитьПараметрыПоКлючевымРеквизитам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	КлючевойРеквизитПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика1ПриИзменении(Элемент)
	
	УстановитьНастройкиОбработкиДокумента();
	КлючевойРеквизитПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика2ПриИзменении(Элемент)
	
	УстановитьНастройкиОбработкиДокумента();
	КлючевойРеквизитПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика3ПриИзменении(Элемент)
	
	УстановитьНастройкиОбработкиДокумента();
	КлючевойРеквизитПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика4ПриИзменении(Элемент)
	
	УстановитьНастройкиОбработкиДокумента();
	КлючевойРеквизитПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика5ПриИзменении(Элемент)
	
	УстановитьНастройкиОбработкиДокумента();
	КлючевойРеквизитПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика6ПриИзменении(Элемент)
	
	УстановитьНастройкиОбработкиДокумента();
	КлючевойРеквизитПриИзменении();
	
КонецПроцедуры

#Область НастройкиРасчетаПоказателей

&НаКлиенте
Процедура ПравилоПроверкиПриИзменении(Элемент)
	
	НастройкиОбработкиДокументаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилоОбработкиПриИзменении(Элемент)
	
	НастройкиОбработкиДокументаПриИзменении();
	ПравилоОбработкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПравилоОбработкиПриИзмененииНаСервере()
	
	БюджетированиеИОтчетность.ЗаполнитьЭлементВнешняяИнформационнаяБаза(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособФормированияОтчетаПриИзменении(Элемент)
	
	НастройкиОбработкиДокументаПриИзменении();
	СпособФормированияОтчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СпособФормированияОтчетаПриИзмененииНаСервере()
	
	БюджетированиеИОтчетность.НастроитьЭлементыНастройкиВидовОтчетов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БланкДляИмпортаПриИзменении(Элемент)
	
	НастройкиОбработкиДокументаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьСвертыванияПриИзменении(Элемент)
	
	НастройкиОбработкиДокументаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешняяИнформационнаяБазаПриИзменении(Элемент)
	
	НастройкиОбработкиДокументаПриИзменении();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = ДатаНачала;
	Диалог.Период.ДатаОкончания = ДатаОкончания;

	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьПериодЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
		
	Если ТипЗнч(РезультатВыбора) <> Тип("СтандартныйПериод") Тогда
		// Период не выбран
		Возврат;
	КонецЕсли;
		
	Если ДатаНачала = РезультатВыбора.ДатаНачала
		И ДатаОкончания = РезультатВыбора.ДатаОкончания Тогда
		// Выбран тот же период
		Возврат;
	КонецЕсли;
	
	ДатаНачала = РезультатВыбора.ДатаНачала;
	ДатаОкончания = РезультатВыбора.ДатаОкончания;
	
	ИзменитьПериодНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПериодНаСервере()
	
	ИзмененКлючевойРеквизит = Истина;

	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		ПериодыУХПовтИсп.ПроверитьИнтервалПериодов(ДатаНачала, ДатаОкончания, ПериодичностьОтчета);
		
		Объект.ПериодОтчета = ОбщегоНазначенияУХ.ПолучитьПериодПоДате(ДатаНачала, ПериодичностьОтчета);
		Объект.ПериодОкончания = ОбщегоНазначенияУХ.ПолучитьПериодПоДате(ДатаОкончания, ПериодичностьОтчета);

	КонецЕсли;
	
	УстановитьПараметрыПоКлючевымРеквизитам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПроверкаПравБланк = ПроверитьВозможностьОтображенияПоБланкуОтчета(Объект.ШаблонОтчета, Объект.Организация);
	Если НЕ ПустаяСтрока(ТекстПроверкаПравБланк) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПроверкаПравБланк);
		Возврат;
	КонецЕсли;
	
	Если ПроверитьНаличиеДокументовСРеквизитамиТекущего() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзмененыНастройкиОбработкиДокумента Тогда
		Если НЕ СохранитьНастройкиОбработкиДокумента() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Ложь;
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Объект", Объект);
	
	Если ВводНовогоДокумента Тогда
		ПараметрыЗакрытия.Вставить("ЗначениеКопирования", ЗначениеКопирования);
		ОткрытьФорму("Документ.НастраиваемыйОтчет.ФормаОбъекта", ПараметрыЗакрытия);
		Закрыть();
	Иначе
		ПараметрыЗакрытия.Вставить("ИзмененКлючевойРеквизит", ИзмененКлючевойРеквизит);
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьНастройкиОбработкиДокумента()
	
	Отказ = Ложь;
	
	ПараметрыНастроек = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(Объект);
	ПараметрыНастроек.ШаблонДокумента = Объект.ВидОтчета;
	ПараметрыНастроек.ВерсияРегламента = ВерсияРегламента;
	УправлениеОтчетамиУХ.УстановитьНастройкиОбработкиШаблонов(ПараметрыНастроек, ЭтаФорма, Отказ);
	
	Возврат Не Отказ;
	
КонецФункции

&НаКлиенте
Процедура Отмена(Команда)

	Модифицированность = Ложь;
	Закрыть();

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостьюДанныхВидаОтчета()
	
	ДанныеВидаОтчета = БюджетированиеИОтчетностьПовтИсп.ДанныеВидаОтчета(Объект.ВидОтчета);
	
	Если ДанныеВидаОтчета.РазделениеПоПроектам Тогда
		Элементы.Проект.Видимость = Истина;
	Иначе
		Объект.Проект = Неопределено;
		Элементы.Проект.Видимость = Ложь;
	КонецЕсли;

	Для Сч = 1 По ДанныеВидаОтчета.МаксКлючевыхАналитик Цикл
		ТекущийЭлемент = Элементы["Аналитика"+Сч];
		ТекущийЭлемент.Видимость = Истина;
		ТипЗначенияАналитики = ДанныеВидаОтчета["ТипЗначенияАналитики"+Сч];
		Если ТипЗначенияАналитики.Типы().Количество() = 1 Тогда
			ТекущийЭлемент.ВыбиратьТип = Ложь;
			Если НЕ ЗначениеЗаполнено(Объект["Аналитика"+Сч]) Тогда
				Объект["Аналитика"+Сч] = ТипЗначенияАналитики.ПривестиЗначение();
			КонецЕсли;
		Иначе
			ТекущийЭлемент.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
		ТекущийЭлемент.ОграничениеТипа = ТипЗначенияАналитики;
		Если ТипЗначенияАналитики.СодержитТип(Тип("СправочникСсылка.ПроизвольныйКлассификаторУХ")) Тогда
			БюджетированиеИОтчетность.УстановитьПараметрыВыбора(ТекущийЭлемент, "Отбор.Владелец", ДанныеВидаОтчета["ВидАналитики"+Сч]);
		КонецЕсли;
	КонецЦикла;
	
	Для Сч = ДанныеВидаОтчета.МаксКлючевыхАналитик+1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
		Объект["Аналитика"+Сч] = Неопределено;
		Элементы["Аналитика"+Сч].Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОграничитьРедактированиеКлючевыхРеквизитов(Форма, МаксАналитикОтчета)
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаТолькоПросмотр.Видимость = Истина;
	Элементы.НадписьТолькоПросмотр.Заголовок = НСтр("ru = 'Экземпляр отчета утвержден. Ключевые реквизиты недоступны для редактирования.'");
	Элементы.ИзменитьПериод.Доступность = Ложь;
	
	Элементы.ВидОтчета.ТолькоПросмотр = Истина;
	Элементы.Сценарий.ТолькоПросмотр = Истина;
	Элементы.УправлениеПериодом.ТолькоПросмотр = Истина;
	Элементы.ПериодичностьОтчета.ТолькоПросмотр = Истина;
	Элементы.Организация.ТолькоПросмотр = Истина;
	Элементы.Проект.ТолькоПросмотр = Истина;
	Для Номер = 1 По МаксАналитикОтчета Цикл
		Элементы["Аналитика" + Номер].ТолькоПросмотр = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыПоКлючевымРеквизитам()
	
	///////////////////////////////////////////////
	// Обновим данные управления периодом сценария
	ДанныеУПС = БюджетированиеИОтчетностьПовтИсп.НайтиУправлениеПериодомСценария(Объект.Сценарий, Объект.ПериодОтчета);
	Если НЕ ЗначениеЗаполнено(ДанныеУПС.УправлениеПериодом)
		И ЗначениеЗаполнено(Объект.Сценарий) И ЗначениеЗаполнено(Объект.ПериодОтчета) Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось определить документ управления отчетным периодом по параметрам:
			|	Сценарий: ""%1"",
			|	Период: ""%2""'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Объект.Сценарий, Объект.ПериодОтчета);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	///////////////////////////////////////////////
	// Обновим связанные реквизиты, если необходимо
	Если Объект.УправлениеПериодом <> ДанныеУПС.УправлениеПериодом Тогда
		Объект.УправлениеПериодом = ДанныеУПС.УправлениеПериодом;
		ИзмененКлючевойРеквизит = Истина;
	КонецЕсли;
	Если Объект.ПериодОтчета <> ДанныеУПС.ПериодСценария Тогда
		Объект.ПериодОтчета = ДанныеУПС.ПериодСценария;
		ИзмененКлючевойРеквизит = Истина;
	КонецЕсли;
	Если Объект.ПериодОкончания <> ДанныеУПС.ПериодСценарияОкончание Тогда
		Объект.ПериодОкончания = ДанныеУПС.ПериодСценарияОкончание;
		ИзмененКлючевойРеквизит = Истина;
	КонецЕсли;
	
	Если ВерсияРегламента <> ДанныеУПС.ВерсияРегламента Тогда
		ВерсияРегламента = ДанныеУПС.ВерсияРегламента;
		Если ИзмененКлючевойРеквизит Тогда
			// Изменены ключевые реквизиты и поменялся регламент
			Объект.ОсновнаяВалюта = Неопределено;
			Объект.ВалютаОтображения = Неопределено;
		КонецЕсли;
		БюджетированиеИОтчетность.ОграничитьОрганизацииПоРегламенту(ВерсияРегламента, Объект.Организация, Элементы.Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУПС.Периодичность) Тогда
		ПериодичностьОтчета = ДанныеУПС.Периодичность;
	КонецЕсли;
	ДатаНачала = ДанныеУПС.ДатаНачала;
	ДатаОкончания = ДанныеУПС.ДатаОкончания;
	
	///////////////////////////////////////////////
	// Рассчитаем настройки обработки показателей
	УстановитьНастройкиОбработкиДокумента();
	
	///////////////////////////////////////////////
	// Заполним валюты отчетности
	Элементы.ВалютаОтображения.СписокВыбора.Очистить();
	ДополнительныеВалюты = "";
	
	тВалюты = БюджетированиеИОтчетностьПовтИсп.ВалютыОтчетности(Объект.УправлениеПериодом, Объект.Организация, Объект.ВидОтчета);
	Для Каждого СтрокаВалюты Из тВалюты Цикл
		Элементы.ВалютаОтображения.СписокВыбора.Добавить(СтрокаВалюты.Валюта, СтрокаВалюты.ВалютаПредставление);
		Если СтрокаВалюты.ОсновнаяВалюта Тогда
			Если Объект.ОсновнаяВалюта <> СтрокаВалюты.Валюта Тогда
				Объект.ОсновнаяВалюта = СтрокаВалюты.Валюта;
				ИзмененКлючевойРеквизит = Истина;
			КонецЕсли;
		Иначе
			ДополнительныеВалюты = ДополнительныеВалюты
				+ ?(ДополнительныеВалюты = "", "", "; ")
				+ СтрокаВалюты.ВалютаПредставление;
		КонецЕсли;
	КонецЦикла;
	
	Если ИзмененКлючевойРеквизит Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	Элементы.ДополнительныеВалюты.Видимость = НЕ ПустаяСтрока(ДополнительныеВалюты);
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаОтображения) Тогда
		Объект.ВалютаОтображения = Объект.ОсновнаяВалюта;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() И НЕ ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
		УправлениеОтчетамиУХ.ЗаполнитьПараметрыОтображения(
			Объект.ЕдиницаИзмерения, Объект.УровеньТочности, Объект.ШаблонОтчета);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиОбработкиДокумента()
	
	ПараметрыНастроек = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(Объект);
	ПараметрыНастроек.ШаблонДокумента = Объект.ВидОтчета;
	ПараметрыНастроек.ВерсияРегламента = ВерсияРегламента;
	
	НастройкиОбработкиДокумента = УправлениеОтчетамиУХ.НастройкиОбработкиШаблонов(ПараметрыНастроек);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиОбработкиДокумента);
	Объект.ШаблонОтчета = НастройкиОбработкиДокумента.БланкДляОтображения;
	ИзмененыНастройкиОбработкиДокумента = Ложь;
	
	БюджетированиеИОтчетность.ЗаполнитьЭлементыОбработкиПоказателейОтчетов(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеДокументовСРеквизитамиТекущего()
	
	Если ПолныеПраваУХ.ПроверитьНаличиеДокументовСРеквизитамиТекущего(Объект) Тогда
		ТекстСообщения = НСтр("ru = 'Уже существует экземпляр отчета с указанными ключевыми реквизитами.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьВозможностьОтображенияПоБланкуОтчета(ШаблонОтчета, Организация)
	
	Возврат ПолныеПраваУХ.ПроверитьВозможностьОтображенияПоБланкуОтчета(ШаблонОтчета, Организация);
	
КонецФункции

#КонецОбласти
